app/controllers/users_controller.rb

	def update
		@user = User.find(params[:id])
		if @user.update_attributes(params[:user])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "users" SET "name" = 'New Name', "email" = 'new@example.com', "password_digest" = '$2a$10$0F7Dk9vv6rK5IByyLGngheSWyPno6eNl5fF8yqI4qSJzB5tvQfIxO', "remember_token" = 'qMw_MI8S3UbEBwpBkooSEw', "updated_at" = '2013-02-08 05:54:02.087262' WHERE "users"."id" = 1